// © Copyright 2004-2010, 2015-2016 HP Development Company, L.P.

HSDTaskName = "Commands";

HSDDescriptionLabel = "Enter commands for the selected printer.";
HSDCommandLabel = "Command:";
HSDGetResponseCheck = "Display response from the device";
HSDLoadButton = "Load Commands…";
HSDSaveButton = "Save Commands…";
HSDStopReceivingButton = "Stop Receiving";

HSDInstructionLabel = "Please enter the hexadecimal code and human-readable description for a new special character.";
HSDHexLabel = "Hexadecimal code:";
HSDDescLabel = "Description:";
HSDHexTableColumn = "Hexadecimal code";
HSDDescTableColumn = "Description";
HSDCancelButton = "Cancel";
HSDOKButton = "OK";

ErrorSendTitle = "Could not send data to the printer";
ErrorSendMsg = "Please check that your printer is connected and turned on, then try again.";

500 = "This screen allows you to send arbitrary commands to the device and retrieve any data returned as a result of the command.";
501 = "Command";
502 = "Response";
503 = "Get response";

HSDSendButtonTitle = "Send Now";

SpecialsCharactersMenuItem = "Special Characters";
AddSpecialCharacterMenuItem = "Add special character…";
EditSpecialCharactersMenuItem = "Edit special characters…";

SpecialCommand0 = "04 - PS end of file ^D";
SpecialCommand1 = "0c - form feed <FF>";
SpecialCommand2 = "0d - carriage return <CR>";
SpecialCommand3 = "1b - escape <ESC>";

NoSaveTitle = "Could not save file";
NoSaveMsg = "Please try another location.";
DidNotSaveMessage = "Please check that there is enough disk space, and you have access privileges to save the file in the specified location.";
NoLoadTitle = "Couldn't open file";
NoLoadMsg = "Please make sure that this is a file that was saved from HP Utiity.";

BigSizeAlertTitle = "File is too large";
BigSizeAlertMsg = "Commands plugin supports files up to 1 MB in size. To upload larger files to the printer please use \"File Upload\" plugin.";

HSDDoneButton = "Done";
HSDEditSpecialsInstructionLabel = "Edit the special characters";
"Special Character Description" = "Special Character Description";
PrinterResponse = "Printer Response";
